{"questions": {"CHECK": "CHECK - Getting the previous speaker to repeat an element or the entire statement that the speaker has not heard or understood.\nExamples:\n1. speaker_1: And they headed straight into the forest. - OTHER\nspeaker_2: Straight into the what? - CHECK\n2. speaker_1: Our friendship is over. - OTHER\nspeaker_2: What do you mean? - CHECK\n3. speaker_1: Do you know Sally? - OTHER\nspeaker_2: Sally? - CHECK\n4. speaker_1: I think that's impossible! - OTHER\nspeaker_2: You mean 30 push-ups? - CHECK\n5. speaker_1: May I turn on the radio then? - OTHER\nspeaker_2: Turn on the radio? CHECK\n6. speaker_1: But let’s go to a disco after dinner. - OTHER\nspeaker_2: To a disco? - CHECK\n7. speaker_1: She taught us that you can do anything that you want to do. - OTHER\nspeaker_2: Anything? - CHECK\n", "CONFIRM": "CONFIRM - Asking for a confirmation of the information received. The speaker wants to make sure that they understood correctly.\nExamples:\n1.  speaker_1: Well, he rang Roman, he rang Roman a week ago. - OTHER\nspeaker_2: Did he? - CONFIRM\n2. speaker_1: It will help us to relax. - OTHER\nspeaker_2: Do you really think so? - CONFIRM\n3. speaker_1: I can do 30 push-ups a minute. - OTHER\nspeaker_2: Really? - CONFIRM\n4. speaker_1: I play goalie myself. - OTHER\nspeaker_2: Oh, yeah? - CONFIRM\n5. speaker_1: Do you believe this? - OTHER\nspeaker_2: Is he really? - CONFIRM\n6. speaker_1: And who’ll cook dinner? - OTHER\nspeaker_1: Will you? - CONFIRM\n7. speaker_1: I found a new way to learn Chinese and it works very well. - OTHER\nspeaker_2: You did? - CONFIRM\n", "CLARIFY": "CLARIFY - Asking a question to get additional information to understand the previous speaker better; requesting to clarify the information receieved.\nExamples:\n1. speaker_1: I am going to visit Anya tomorrow. - OTHER\nspeaker_2: Where does she live? - CLARIFY\n2. speaker_1: She really didn’t have any teacher’s pets. - OTHER\nspeaker_2: Do you know what she is doing now? - CLARIFY\n3. speaker_1: Then, she started writing children’s book. - OTHER\nspeaker_2: Have you ever read one of the books? - CLARIFY\n4. speaker_1: I was rather disappointed. - OTHER\nspeaker_2: Why? - CLARIFY\n5. speaker_1: Why? - CLARIFY\nspeaker_1: What had you expected? - CLARIFY\n6. speaker_2: Of course, tomorrow evening there will be a most exciting game. - OTHER\nspeaker_1: Who plays who? - CLARIFY\n7. speaker_1: Right. - OTHER\nspeaker_1: What present should we give him this time? - CLARIFY\n8. speaker_1: What present should we give him this time? - CLARIFY\nspeaker_1: By the way, how old is he? - CLARIFY\n9. speaker_1: You should take the initiative and make some changes first. - OTHER\nspeaker_2: What should I do then? - CLARIFY", "PROBE": "PROBE - Requesting a confirmation of the information necessary to make clear the previous speaker's statement. The speaker themselves speculates about the information that they want to be confirmed.\nExamples:\n1. speaker_1: Then they went to visit Roman. - OTHER\nspeaker_2: Because Roman lives in Denning Road also? - PROBE\n2. speaker_1: You just sit there in a daze, gazing at the monitor and dealing with files and documents. - OTHER\nspeaker_2: Why don't you give a full play to your energy after work? - PROBE\n3. speaker_1: Great. - OTHER\nspeaker_2: Is it a two bedroom house? - PROBE\n4. speaker_1: The Filipino kid is a genius. - OTHER\nspeaker_2: So you'll make the Stars.com deadline, and have us up and running next week? - PROBE\n5. speaker_1: Come by any time. - OTHER\nspeaker_2: Shall I say around ten o'clock? - PROBE\n6. speaker_1: They have a big new fancy house. - OTHER\nspeaker_2: Does Jim make a lot of money? - PROBE\n7. speaker_1: You said she was strict. - OTHER\nspeaker_1: Did she have a lot of rules? - PROBE\nNB: The speaker asks a question to confirm their own idea.\n", "REBOUND": "REBOUND - Questioning the relevance, reliability of the previous statement, often an interrogative sentence, but not always.\nExamples:\n1.  speaker_1: This conversation needs Allenby. - OTHER\nspeaker_2: Oh he’s in London. So what can we do? - REBOUND\n2. speaker_1: Mary, I really like your new dress. - OTHER\nspeaker_2: You don't know anything about fashion. - REBOUND\n3. speaker_1: I think the sun is going to explode soon. - OTHER\nspeaker_2: But who are you to say so, you don't know anything about cosmology. - REBOUND\n4. speaker_1: I heard a story about a robbery in Amsterdam - OTHER\nspeaker_2: That was fake news, forget about it. - REBOUND\n5. speaker_1: I heard a story about a robbery in Amsterdam - OTHER\nspeaker_2: That was fake news, forget about it. - REBOUND\n6. speaker_1: It will help us to relax. - OTHER\nspeaker_2: Do you really think so? - REBOUND\n7. speaker_1: I can do 30 push-ups a minute. - OTHER\nspeaker_2: Really? - REBOUND\n8. speaker_1: I won't. - OTHER\nspeaker_2: So what's the problem? - REBOUND\n9. speaker_1: Anything? - OTHER\nspeaker_2: Do you really believe that we can do anything? - REBOUND", "RECHALLENGE": "RECHALLENGE - Offering an alternative position, often an interrogative sentence.\nExamples:\n1.  speaker_1: Messi is the best. - OTHER\nspeaker_2: Maybe Pele is the best one? - RECHALLENGE\n2. speaker_1: Mary, I really like your new dress. - OTHER\nspeaker_2: The old one is better, don't you think so? - RECHALLENGE\n3. speaker_1: So that we can sit down together and listen to some music. - OTHER\nspeaker_2: Listen to some music? And who’ll cook dinner? - RECHALLENGE\n4. speaker_1: She don’t have any teacher’s pets. - OTHER\nspeaker_2: Doesn’t every teacher have a teacher’s pet? - RECHALLENGE\n5. speaker_1: I love Moschino. - OTHER\nspeaker_2: Oh, gross, I think Gucci is so much better! - RECHALLENGE"}, "upper_level": {"DECLARATIVE": "DECLARATIVE - declarative sentences, contain affirmation or denial of some facts, events, or actions.\nExamples:\n1. I can’t stand him. - DECLARATIVE\n2. I don’t know. - DECLARATIVE\n3. She then decided to travel alone. - DECLARATIVE\n4. In the end, they had a big fight. - DECLARATIVE\nNB! If a sentence contains an order, a request or a suggesion, it is included into this category.\nExamples:\n1. Don't do it! - OTHER\n2. Let's call him! - OTHER\n", "MISCELLANEOUS": "MISCELLANEOUS - sentences (usually short) that are used to express gratitude, manifest emotions, display attention to the previous speaker, draw the speaker's attention\nExamples:\n1. Thank you! - MISCELLANEOUS\n2. Oh my god! - MISCELLANEOUS\n3. Great! - MISCELLANEOUS\n4. Sounds good. - MISCELLANEOUS\n5. Alright. - MISCELLANEOUS\n6. Hey there! - MISCELLANEOUS\n7. Morning! - MISCELLANEOUS\n8. David! - MISCELLANEOUS\n", "INTERROGATIVE": "INTERROGATIVE - contains a question of some kind.\nExamples:\n1. Do you like dancing? - INTERROGATIVE\n2. What has he done? - INTERROGATIVE\n3. Why did he say that? - INTERROGATIVE\n4. Right? - INTERROGATIVE\n5. Can you believe that? - INTERROGATIVE\nNB! An interrogative sentence may end with a dot as well as with a question mark.\nExamples:\n1. You must have been there many times. - INTERROGATIVE\n2. I’d like to know what plans you’ve got for tomorrow. - INTERROGATIVE\n", "COMMAND": "COMMAND - a command, a request or an invitation.\nExamples:\n1. Let’s discuss this later. - COMMAND\n2. Let's talk about something else. - COMMAND\n3. Could you give me that book? - COMMAND\n4. How about going to London? - COMMAND\n", "RESPONSE": "RESPONSE - a response to a question. Can be positive, negative, or detailed.\nExamples:\n1. speaker_1 What’s the plot of your new movie? - INTERROGATIVE\nspeaker_2 It’s a story about a policemen who is investigating a series of strange murders. - RESPONSE\n2. speaker_1: Does that bother you? - INTERROGATIVE\nspeaker_2: Not at all. - RESPONSE\n3. speaker_1: Have you seen the movie yet? - INTERROGATIVE\nspeaker_1: I mean, the Avengers. - DECLARATIVE\nspeaker_2: Yes. - RESPONSE\nspeaker_2: I have. - DECLARATIVE\n"}}